blog/app/controllers/comments_controller.rb

  def show
    @comment = @post.comments.find(params[:id])
---
SELECT * FROM "comments" WHERE ("comments"."id" = 1 AND ("comments".post_id = 4))

  def create
    @comment = @post.comments.build(params[:comment])
    if @comment.save
---
INSERT INTO "comments" ("created_at", "body", "updated_at", "post_id", "commenter") VALUES('2010-07-09 17:51:41', 'W00t!', '2010-07-09 17:51:41', 4, 'obsidian')

  def edit
    @comment = @post.comments.find(params[:id])
---
SELECT * FROM "comments" WHERE ("comments"."id" = 1 AND ("comments".post_id = 4))

  def update
    @comment = Comment.find(params[:id])
    if @comment.update_attributes(params[:comment])
---
SELECT * FROM "comments" WHERE ("comments"."id" = 1)
UPDATE "comments" SET "updated_at" = '2010-07-09 17:51:50', "body" = 'W00t!1' WHERE "id" = 1

  def find_post
    @post = Post.find(params[:post_id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 4)