blog/app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("name", "created_at", "title", "updated_at", "content") VALUES('Post1', '2010-07-09 14:59:42', 'Riding', '2010-07-09 14:59:42', 'Today, I started riding the rails. I''m wondering if it is actually going to be any benefit to my skills as a developer and/or my job interview.')

  def update
   # @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
UPDATE "posts" SET "updated_at" = '2010-07-09 16:04:00', "content" = 'I find this all very interesting, indeed. Hrmmah!' WHERE "id" = 2

  def destroy
   # @post = Post.find(params[:id])
    @post.destroy
---
DELETE FROM "posts" WHERE "id" = 1