pim/app/controllers/contacts_controller.rb

SELECT * FROM "contacts" WHERE (user_id = 2)
---
  def index
    @contacts = Contact.all(:conditions => ["user_id = :user_id", { :user_id => current_user.id }])

SELECT * FROM "contacts" WHERE ("contacts"."id" = 1)
---
  def edit
    @contact = Contact.find(params[:id])

INSERT INTO "contacts" ("c_fname", "created_at", "updated_at", "c_mname", "user_id", "c_lname") VALUES('Rebecca', '2010-07-30 21:30:34', '2010-07-30 21:30:34', 'May', NULL, 'Foley')
---
  def create
    @contact = Contact.new(params[:contact])

    respond_to do |format|
      if @contact.save

SELECT * FROM "contacts" WHERE ("contacts"."id" = 1)
UPDATE "contacts" SET "updated_at" = '2010-08-06 21:22:30', "c_mname" = 'L' WHERE "id" = 7
---
  def update
    @contact = Contact.find(params[:id])

    respond_to do |format|
      if @contact.update_attributes(params[:contact])

SELECT * FROM "contacts" WHERE ("contacts"."id" = 5)
DELETE FROM "contacts" WHERE "id" = 5
---
  def destroy
    @contact = Contact.find(params[:id])
    @contact.destroy