pim/app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all(:conditions => ["user_id = :user_id", { :user_id => current_user.id }])
---
SELECT * FROM "tasks" WHERE (user_id = 1)

  def create
    @task = Task.new(params[:task])

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("name", "created_at", "updated_at", "priority", "deadline", "user_id", "description") VALUES('Finish Tasks', '2010-08-07 14:40:35', '2010-08-07 14:40:35', 1, '2010-08-09 12:00:00', 1, 'New

  def update
    @task = Task.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(params[:task])
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)
UPDATE "tasks" SET "updated_at" = '2010-08-08 20:52:30', "description" = 'Routing

  def destroy
    @task = Task.find(params[:id])
    @task.destroy
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)
DELETE FROM "tasks" WHERE "id" = 1